app/views/favorites/_form.html.erb

<p>
	<%  @favorite.item.item_images.each do |listing_image| %>
---
SELECT "item_images".* FROM "item_images" WHERE "item_images"."item_id" = 2 LIMIT 1
SELECT "items".* FROM "items" WHERE "items"."id" = 2 LIMIT 1