app/views/favorites/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
    <td><%= link_to favorite.item.title, item_url(favorite.item_id) %></td>
    <td><% a = favorite.user %> <%= a.first_name %> <%=a.last_name%></td>