app/views/users/_form.html.erb

SELECT "states".* FROM "states" ORDER BY state_abbreviation ASC
---
    <%= f.label :state_id %><br />
    <%= f.collection_select :state_id, State.order("state_abbreviation ASC").all, :id, :state_abbreviation %>

SELECT "neighborhoods".* FROM "neighborhoods"
---
    <%= f.label :neighborhood %><br />
    <%= f.collection_select :neighborhood_id, Neighborhood.all, :id, :name %>