app/views/users/_user_account.html.erb

SELECT "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = ? LIMIT 1  [["id", 10]]
---
  <b>Neighborhood:</b>
  <%= Neighborhood.find(@user.neighborhood_id).name %>