app/views/users/index.html.erb

    <td><%= user.zip %></td>
    <td><%= Neighborhood.find(user.neighborhood_id).name %></td>
---
SELECT "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = ? LIMIT 1  [["id", 3]]