app/views/users/show.html.erb

  <% @user.nearbys(50).each do |user| %>
    <% user.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = 5