app/views/items/_form.html.erb

    <%= f.label :category_id %><br />
    <%= f.collection_select :category_id, Category.all, :id, :title %>
---
SELECT "categories".* FROM "categories"