app/views/items/index.html.erb

SELECT "categories".* FROM "categories"
SELECT "neighborhoods".* FROM "neighborhoods"
---
			<%= form_tag items_url, :method => :get, :id => "search_form" do%>
			<td><%= select_tag :category, options_from_collection_for_select(Category.all, :id, :title, params[:category]), :prompt => 'Select a Category'%></td>
			<td><%= select_tag :neighborhood, options_from_collection_for_select(Neighborhood.all, :id, :name, params[:neighborhood]), :prompt => 'Select Neighborhood', :include_blank => true %></td>