app/views/items/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
<div id="item_map">
  <% if @item.user.latitude.present? %>