app/controllers/favorites_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 2
---
  def index
    @user = current_user
    @favorites = @user.favorites.all

INSERT INTO "favorites" ("created_at", "item_id", "note", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 13 Nov 2011 02:24:29 UTC +00:00], ["item_id", nil], ["note", "This is a great gift for dad!"], ["updated_at", Sun, 13 Nov 2011 02:24:29 UTC +00:00], ["user_id", nil]]
---
  def create
    @favorite = Favorite.new
    @favorite.user_id = current_user.id
    @favorite.item_id = params[:id]
    @favorite.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 8]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 8 AND "favorites"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    user = User.find(session[:user_id])
    if user.favorites.find(params[:id]).present?

SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = ? LIMIT 1  [["id", "8"]]
UPDATE "favorites" SET "note" = 'To beard or not to beard?', "updated_at" = '2011-11-14 16:05:07.990114' WHERE "favorites"."id" = 9
---
  def update
      @favorite = Favorite.find(params[:id])
      @favorite.note = params[:favorite][:note]
      @favorite.save     #THIS CODE HAS NO ERRORS, BUT OUR NOTE IS NOT SAVING!!!!??? WTF????