app/controllers/home_controller.rb

SELECT "items".* FROM "items"
---
  def index
    @User = User.new
    @items = Item.all