app/controllers/items_controller.rb

  def index
    @items = Item.scoped

    if params[:Category].present?
      @items = @items.where(:category_id => params[:Category])
    end

     if params[:price].present?
         @items = @items.where("price <= ?", params[:price])
        # @items = @items.where(":price <= ?", "#{params[:price]}")
        # @items = @items.where(":price <= ?", "%#{params[:price]}%")
     end

    if params[:search].present?
      @items = @items.where(["title LIKE ?", "%#{params[:search]}%"])
    end

    if params['Neighborhood'].present?
      users = User.where(:neighborhood_id => params['Neighborhood'])
      @items = @items.where(["user_id IN ( ? )", users.map{|u| u.id}])
    end

    @items = @items.page(params[:page]).per(5)
---
SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 36]]
SELECT "neighborhoods".* FROM "neighborhoods"
SELECT "users".* FROM "users" WHERE "users"."neighborhood_id" = 4
SELECT "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."user_id" = 3 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "items".* FROM "items" WHERE "items"."category_id" = 69 AND (user_id IN ( 3 )) LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "items" WHERE "items"."category_id" = 69 AND (user_id IN ( 3 ))

  def show
    @item = Item.find(params[:id])
    @user = @item.user_id
    a=@item.item_images.count
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "index"]]
SELECT COUNT(*) FROM "item_images" WHERE "item_images"."item_id" = 4

  def edit
    user = current_user
    @item = Item.find(params[:id])
    img_number_to_show = 4 - @item.item_images.count
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "1"]]
SELECT COUNT(*) FROM "item_images" WHERE "item_images"."item_id" = 2

  def create
    @item = Item.new(params[:item])
    @item.user = current_user

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("category_id", "created_at", "description", "made_to_order", "price", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @item = Item.find(params[:id])

    respond_to do |format|
      if @item.update_attributes(params[:item])
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "items" SET "updated_at" = '2011-11-12 18:48:18.804614', "price" = 25.0 WHERE "items"."id" = 1