app/controllers/users_controller.rb

  def show
    # @user = session[:user_id]     WE'll add this in as a filter when the time is right.
    #   @user = User.find(@user)    This line too, then delete the next line "@user = User. find....."
    @user = User.find(params[:id])
    @items = Item.where(:user_id => @user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "items".* FROM "items" WHERE "items"."user_id" = 5

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("address", "admin", "bio", "city", "created_at", "email", "first_name", "last_name", "latitude", "longitude", "neighborhood_id", "password_digest", "seller", "state_id", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "9"]]
UPDATE "users" SET "password_digest" = '$2a$10$gB.Eh2CcqELwODCwS70DueVhFS35SnJ9tigq4q1bvYPl1ZOiyaaPC', "state_id" = 116, "neighborhood_id" = 3, "updated_at" = '2011-11-13 17:18:04.123803' WHERE "users"."id" = 1